{
  "backend/main.mo": "Actor implementing user profiles, contact form submissions, and access-controlled admin queries using authorization mixins.",
  "feature_evidence.json": "Feature evidence report describing a UI image‑replacement change and mapping it to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles in layout, UI components, hooks, and styling.",
  "frontend/index.css": "Tailwind base and utility layers defining OKLCH color theme variables, dark mode tokens, and global styling.",
  "frontend/index.html": "HTML entry point with metadata, Google Fonts, root mount point, and script loader for the React app.",
  "frontend/src/App.tsx": "Main React app layout composing all sections, decorative effects, footer, and admin panel.",
  "frontend/src/components/admin/AdminPanel.tsx": "Admin panel trigger and sheet showing login controls and submissions panel, gated by identity.",
  "frontend/src/components/admin/AdminSubmissionsPanel.tsx": "Admin panel that checks admin access and displays contact submissions with loading and empty states.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/CursorSpotlight.tsx": "Component showing a radial cursor‑tracking spotlight when motion is allowed and pointer is fine.",
  "frontend/src/components/DecorativeBackground.tsx": "Fixed background component rendering decorative shapes, gradient overlays, and orb images.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass‑styled card wrapper with optional hover lift and light theme styling.",
  "frontend/src/components/sections/AboutSection.tsx": "Animated about section showing background, intro text, and developer description using scroll reveal.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form with validation, submission handling, success/error states, and scroll-reveal animation.",
  "frontend/src/components/sections/HeroSection.tsx": "Landing hero section with parallax effects, intro text, social links, and scroll-to-section actions.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Showcases featured projects with images, tags, and animated reveal effects.",
  "frontend/src/components/sections/SkillsSection.tsx": "Displays a grid of skill icons with hover animations and scroll-reveal transitions.",
  "frontend/src/components/TopNav.tsx": "Responsive top navigation bar with smooth scrolling, desktop links, and mobile sheet menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useContactSubmission.ts": "Provides a mutation hook to submit contact form data via an actor and track submission status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state, login flow, and stored identities.",
  "frontend/src/hooks/useParallax.ts": "Returns a scroll-based offset value for parallax effects with reduced‑motion support.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced‑motion preference and updates on changes.",
  "frontend/src/hooks/useQueries.ts": "Defines queries for fetching contact submissions and checking admin status using an actor.",
  "frontend/src/hooks/useScrollReveal.ts": "Provides a ref and visibility state to reveal elements when scrolled into view using IntersectionObserver.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom CSS variables, utilities, animations, and reduced‑motion rules for the light theme.",
  "frontend/src/lib/validation.ts": "Exports simple required‑field and email validators.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity providers.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the project.",
  "project_state.json": "Describes project requirements, theme direction, architecture notes, known issues, and existing feature definitions."
}