{
  "backend/main.mo": "Actor implementing user profiles, contact submissions, and admin/user authorization using AccessControl.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend components, hooks, utilities, and layout elements.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light/dark themes and applying global background/foreground styling.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and mounting the React app.",
  "frontend/src/App.tsx": "Main React app composing sections, navigation, decorative UI, footer, and admin panel within a light theme layout.",
  "frontend/src/components/admin/AdminPanel.tsx": "Floating admin panel trigger showing login control and submissions panel when authenticated.",
  "frontend/src/components/admin/AdminSubmissionsPanel.tsx": "Admin-only view loading and displaying contact submissions with permission checks and formatted details.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling auth state, errors, and cache clearing.",
  "frontend/src/components/CursorSpotlight.tsx": "Component rendering a mouse-following spotlight effect on devices with fine pointers unless reduced motion is enabled.",
  "frontend/src/components/DecorativeBackground.tsx": "Fixed decorative background with images and gradient overlays for visual ambiance.",
  "frontend/src/components/GlassCard.tsx": "Reusable glassmorphism card wrapper with optional hover animation.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with scroll‑reveal animation and descriptive text inside a GlassCard component.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with validation, submission via a custom hook, success/error handling, and scroll‑reveal effects.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the hero banner with parallax graphics, social links, and scroll‑to interactions using reveal animations.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Shows a grid of predefined projects with images, tags, and external links, animated with scroll‑reveal.",
  "frontend/src/components/sections/SkillsSection.tsx": "Lists skills with icons in a responsive grid, each animated with scroll‑reveal and hover effects.",
  "frontend/src/components/TopNav.tsx": "Sticky top navigation bar with smooth scrolling, mobile sheet menu, and scroll-responsive styling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useContactSubmission.ts": "Handles contact form submission through the backend actor using a mutation with success state and cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, and logout states. Wraps AuthClient creation and exposes identity and status flags through a custom hook.",
  "frontend/src/hooks/useParallax.ts": "Implements a parallax scroll effect hook that updates an offset based on scroll position unless reduced-motion is preferred.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion setting via matchMedia and updates reactively.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch all submissions and check admin status using an actor returned from useActor.",
  "frontend/src/hooks/useScrollReveal.ts": "Provides a hook that uses IntersectionObserver to mark elements visible when scrolled into view, respecting reduced-motion settings.",
  "frontend/src/index.css": "Tailwind base and utility layers defining light theme variables, accessibility styles, animations, and custom utility classes.",
  "frontend/src/lib/validation.ts": "Contains simple validation helpers for required fields and email format checking.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors, radii, shadows, fonts, and animations.",
  "project_state.json": "Stores project metadata, requirements, theme specifications, known issues, and architectural notes for the portfolio site."
}