{
  "backend/main.mo": "Motoko canister managing user profiles with access control plus public contact-form submissions and an admin-only retrieval function.",
  "feature_evidence.json": "Feature evidence report mapping theme, layout, animation, and styling updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file including components, hooks, styles, and configuration.",
  "frontend/index.css": "Global Tailwind-based light-theme style tokens and base element styling including color variables and dark-mode overrides.",
  "frontend/index.html": "Main HTML entry file defining metadata, fonts, and root mount point for the React app.",
  "frontend/src/App.tsx": "Root React component assembling all sections, decorative elements, navigation, footer, and admin panel within a light gradient layout.",
  "frontend/src/components/admin/AdminPanel.tsx": "Shows a floating admin-panel trigger for authenticated Internet Identity users and opens a sheet containing admin tools.",
  "frontend/src/components/admin/AdminSubmissionsPanel.tsx": "Fetches and displays contact form submissions for admins, handling loading, permission checks, and formatted submission cards.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with status handling and query cache clearing.",
  "frontend/src/components/CursorSpotlight.tsx": "Interactive cursor‑tracking spotlight effect that activates on desktop unless reduced motion is preferred.",
  "frontend/src/components/DecorativeBackground.tsx": "Static background layer rendering decorative shapes, gradients, and light-theme accents behind the page content.",
  "frontend/src/components/GlassCard.tsx": "Reusable light glassmorphism card wrapper with blur, soft shadows, and optional hover lift animation.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an 'About Me' section with scroll-reveal animation and descriptive text inside a GlassCard.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with validation, submission via hook, error handling, and scroll reveal animation.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the landing hero section with parallax effects, social links, text content, and smooth-scroll CTA buttons.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Shows a grid of featured projects with images, descriptions, tags, and external links using scroll-reveal effects.",
  "frontend/src/components/sections/SkillsSection.tsx": "Presents a grid of skill icons and labels with staggered scroll-reveal animation.",
  "frontend/src/components/TopNav.tsx": "Sticky responsive navigation bar with smooth scrolling, mobile sheet menu, and light-theme blur and shadow styling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useContactSubmission.ts": "Provides a mutation for submitting contact form data through the actor and tracks submission states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity context.",
  "frontend/src/hooks/useParallax.ts": "Computes a scroll‑based parallax offset with reduced‑motion support.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Returns whether the user’s system requests reduced motion and updates on preference changes.",
  "frontend/src/hooks/useQueries.ts": "Exposes queries for fetching all contact submissions and checking admin status via the actor.",
  "frontend/src/hooks/useScrollReveal.ts": "Provides a ref and visibility flag using IntersectionObserver for scroll‑reveal animations.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, utilities, animations, and accessibility rules.",
  "frontend/src/lib/validation.ts": "Contains simple validators for required fields and email format.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session‑based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, animations, and theme settings.",
  "project_state.json": "Stores the project’s current state, including theme requirements, architectural notes, image needs, known conflicts, and existing feature definitions for the portfolio site."
}