{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Light SaaS-style theme refresh with polished motion, split hero, and icon/image cards",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Switch overall site styling from dark glassmorphism to a light SaaS-style theme with subtle light glass cards, rounded corners, and layered sections.",
      "acceptanceCriteria": [
        "The default page renders in a light theme (no forced dark mode on initial load).",
        "Background is off-white/soft gray and readable (not pure white), with subtle depth and soft section separation.",
        "Glass-card surfaces appear as subtle light glassmorphism (low opacity + blur) with soft shadow and rounded corners.",
        "Existing components (TopNav, sections, footer, admin panel) remain functional and visually consistent in the light theme."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Remove the forced dark mode class on the body so the site defaults to the new light theme; keep metadata intact."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update base styles and utility classes to support a light SaaS-style palette (off-white background, soft shadows, subtle light glassmorphism) while keeping existing components visually consistent."
        },
        {
          "path": "frontend/src/components/GlassCard.tsx",
          "operation": "modify",
          "description": "Refine GlassCard styling to a subtle light-glass surface (low-opacity fill + blur + soft shadow) and light-theme hover behavior."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Adjust TopNav background/blur/border/shadow styling to match light theme while keeping the existing responsive navigation behavior."
        },
        {
          "path": "frontend/src/components/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Update AdminPanel button/sheet styling to align with the light theme while preserving the existing authenticated-only visibility behavior."
        },
        {
          "path": "frontend/src/components/admin/AdminSubmissionsPanel.tsx",
          "operation": "modify",
          "description": "Update admin submissions card/border/background styles for the light theme while keeping the existing admin guard and read-only listing behavior."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Update login/logout button styling to match light theme while keeping existing Internet Identity logic unchanged."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the app shell and footer use the light theme surfaces and layered section separation while preserving existing layout and functionality."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Update global styling tokens and page background treatment (subtle gradients and soft lighting) for a coherent light theme with accessible contrast.",
      "acceptanceCriteria": [
        "Global CSS variables and base styles produce a coherent light palette (background, foreground, muted, border, ring).",
        "The page background uses subtle gradients/lighting appropriate for a light SaaS layout (no dark bottom gradient).",
        "All text maintains accessible contrast against the light background."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Rework :root theme tokens for a light palette (background/foreground/muted/border/ring) and replace the current dark gradient body background with a subtle light gradient/lighting treatment."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Align Tailwind theme extensions (shadows/animations/utilities) with the new light tokens and add any needed lightweight keyframes for reveals/parallax polish."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Revise Hero to a responsive SaaS split layout with exact headline text, intro copy, animated social icons, and a floating/tilted profile image card.",
      "acceptanceCriteria": [
        "Hero section layout is two-column on desktop and stacks cleanly on mobile.",
        "Headline text in Hero matches exactly: “Full-Stack Web & Application Developer”.",
        "Hero includes visible social icons (e.g., GitHub/LinkedIn) with hover animation and accessible labels.",
        "Hero includes a profile image displayed in a rounded card with soft shadow; image/card has a subtle tilt or floating effect.",
        "Hero retains smooth navigation behavior (scrolling to Projects and Contact remains available from the hero area)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/hero-bg-light.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated light hero background image asset at frontend/public/assets/generated/hero-bg-light.dim_1920x1080.png."
        },
        {
          "path": "frontend/public/assets/generated/accent-orb-light.dim_800x800.png",
          "operation": "create",
          "description": "Add the generated light accent orb image asset at frontend/public/assets/generated/accent-orb-light.dim_800x800.png."
        },
        {
          "path": "frontend/public/assets/generated/profile.dim_900x1100.png",
          "operation": "create",
          "description": "Add the generated profile illustration/avatar image asset at frontend/public/assets/generated/profile.dim_900x1100.png."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Implement the new hero split layout: left column with exact headline text, 2–3 line intro, and social icons (with hover animation + accessible labels); right column with a rounded, softly shadowed profile card using frontend/public/assets/generated/profile.dim_900x1100.png and a subtle tilt/floating effect; update hero background usage to frontend/public/assets/generated/hero-bg-light.dim_1920x1080.png and orb to frontend/public/assets/generated/accent-orb-light.dim_800x800.png."
        },
        {
          "path": "frontend/src/components/TopNav.tsx",
          "operation": "modify",
          "description": "Ensure hero scroll targets remain consistent with nav links and the updated hero CTA buttons (Projects/Contact)."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add lightweight scroll-reveal, hover polish, and subtle transitions across the page while honoring prefers-reduced-motion.",
      "acceptanceCriteria": [
        "As the user scrolls, each section’s primary content animates in with a subtle fade + upward motion (once per session/viewport entry is acceptable).",
        "Buttons/cards exhibit gentle lift/shadow/scale on hover without jank.",
        "When the OS setting prefers-reduced-motion is enabled, scroll/hover/transition animations are disabled or reduced to near-zero."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePrefersReducedMotion.ts",
          "operation": "create",
          "description": "Create a small hook that returns whether prefers-reduced-motion is enabled, to gate scroll reveal, parallax, and cursor effects."
        },
        {
          "path": "frontend/src/hooks/useScrollReveal.ts",
          "operation": "create",
          "description": "Create a lightweight IntersectionObserver-based hook for fade-in + slide-up reveal of section content, respecting prefers-reduced-motion."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add light-theme-appropriate reveal/hover transition utilities (fade/slide, lift/shadow/scale) and ensure reduced-motion rules minimize these effects."
        },
        {
          "path": "frontend/src/components/sections/AboutSection.tsx",
          "operation": "modify",
          "description": "Apply scroll-reveal to the About section primary content using the new scroll reveal hook."
        },
        {
          "path": "frontend/src/components/sections/SkillsSection.tsx",
          "operation": "modify",
          "description": "Apply scroll-reveal to Skills section heading and grid content; ensure hover effects align with the new light theme and reduced-motion behavior."
        },
        {
          "path": "frontend/src/components/sections/ProjectsSection.tsx",
          "operation": "modify",
          "description": "Apply scroll-reveal to Projects section heading and cards; refine hover animations to be subtle and performant."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Apply scroll-reveal to Contact section primary content while preserving validation/submission behavior and success/error states."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Add gentle, performant hero parallax for imagery/decorations and disable or reduce it under prefers-reduced-motion.",
      "acceptanceCriteria": [
        "At least one hero visual element exhibits subtle parallax movement during scroll.",
        "Parallax effect does not cause layout shifts and remains smooth on mid-range devices.",
        "Parallax is disabled or significantly reduced under prefers-reduced-motion."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useParallax.ts",
          "operation": "create",
          "description": "Create a small scroll-based parallax hook for subtle transform-only motion (no layout shifts), gated by prefers-reduced-motion."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Apply subtle parallax to at least one hero visual element (e.g., profile card and/or accent orb) using the parallax hook, transform-only for performance."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Add subtle cursor-based micro-interactions (spotlight/glow) on key surfaces, with graceful touch fallback and reduced-motion support.",
      "acceptanceCriteria": [
        "Cursor micro-interaction is visible but subtle on desktop pointer devices (no large/flashy cursor replacements).",
        "Effect degrades gracefully on touch devices (no broken visuals).",
        "Effect is disabled or reduced under prefers-reduced-motion."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CursorSpotlight.tsx",
          "operation": "create",
          "description": "Create a minimal cursor spotlight/glow overlay component that activates only for fine pointer devices, uses transform/CSS variables for performance, and disables/reduces behavior under prefers-reduced-motion."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add supporting styles for the cursor spotlight effect (subtle light-theme glow, pointer-events disabled), ensuring it never obstructs readability."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire CursorSpotlight into the app shell so the effect applies to key page surfaces without interfering with clicking/scrolling."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Revise Skills section into an icon card grid with subtle hover glow while preserving the exact listed skills.",
      "acceptanceCriteria": [
        "Skills are presented as individual cards (or a clearly card-based grid) with an icon and label per skill.",
        "Cards have a subtle hover glow consistent with the light theme.",
        "All listed skills appear and are readable; no listed skill is omitted."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/SkillsSection.tsx",
          "operation": "modify",
          "description": "Replace the grouped list with an icon-card grid for the required skills only: HTML, CSS, JavaScript, React, Next.js, Node.js, Flask, MySQL, MongoDB, Redis, AWS, Python AI/ML workflows; add subtle light-theme hover glow and keep responsive layout."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust light-theme utility classes for the skills icon cards (soft border, subtle hover glow) consistent with the overall theme."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Revise Projects section into image thumbnail cards with title, short description, hover polish, and preserved GitHub URLs.",
      "acceptanceCriteria": [
        "Each project card displays a thumbnail image, project title, and short description.",
        "Project cards have smooth, subtle hover animations (lift/shadow/scale) consistent with the light theme.",
        "Each project includes a “View on GitHub” link pointing to the exact existing URLs already used in the app."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/project-home-price-predictor.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated project thumbnail image asset at frontend/public/assets/generated/project-home-price-predictor.dim_1200x800.png."
        },
        {
          "path": "frontend/public/assets/generated/project-simplenntp.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated project thumbnail image asset at frontend/public/assets/generated/project-simplenntp.dim_1200x800.png."
        },
        {
          "path": "frontend/public/assets/generated/project-persevan-ai.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated project thumbnail image asset at frontend/public/assets/generated/project-persevan-ai.dim_1200x800.png."
        },
        {
          "path": "frontend/src/components/sections/ProjectsSection.tsx",
          "operation": "modify",
          "description": "Update project data to include thumbnail images and render card layout with image, title, and short description; keep existing GitHub URLs exactly and include a clear “View on GitHub” link per project; apply light-theme hover polish."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Update Contact section styling for the light theme with clean inputs and soft focus effects while preserving validation, submission, states, and social links.",
      "acceptanceCriteria": [
        "Contact form fields and buttons are styled for the light theme with soft focus states.",
        "Existing client-side validation, submission behavior, and success/error messaging remain functional.",
        "Social/profile links remain visible and accessible within the contact section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Adjust Contact form and info-card styling to light SaaS theme (clean fields, soft focus states, subtle borders/shadows) while keeping validation, submission behavior, success/error alerts, and social/profile links unchanged functionally."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Tune global focus ring and form control styling for a soft light-theme focus effect that remains accessible."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Add light-theme floating decorative shapes/background accents that create depth and layered sections without obstructing content.",
      "acceptanceCriteria": [
        "At least 2 decorative background elements/shapes are visible (e.g., soft blobs, orbs, abstract shapes) with subtle motion or positioning.",
        "Decorations never obstruct text readability and remain subtle on all breakpoints.",
        "Decorations are non-interactive and do not interfere with scrolling/clicking (pointer-events disabled)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/decor-shapes-light.dim_1400x900.png",
          "operation": "create",
          "description": "Add the generated decorative shapes image asset at frontend/public/assets/generated/decor-shapes-light.dim_1400x900.png."
        },
        {
          "path": "frontend/src/components/DecorativeBackground.tsx",
          "operation": "create",
          "description": "Create a non-interactive decorative background component that places at least two subtle accents (e.g., frontend/public/assets/generated/decor-shapes-light.dim_1400x900.png plus orb accents) with pointer-events disabled and responsive positioning."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire DecorativeBackground into the app shell behind main content to provide layered section depth without affecting navigation or interactivity."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Ensure hero decorative accents integrate with the global decorative background and remain subtle/readable across breakpoints."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Maintain responsiveness, performance, and SEO metadata after the redesign without adding heavy dependencies.",
      "acceptanceCriteria": [
        "All sections render cleanly on mobile, tablet, and desktop without overflow or broken layouts.",
        "No new heavy dependencies are introduced for animations/parallax/cursor effects; performance remains smooth.",
        "Existing title/meta description remain present (update only if needed to align with the new hero headline), and semantic section structure is preserved."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Review and keep title/meta description present; update meta description text only if needed to align with the hero headline “Full-Stack Web & Application Developer”, without changing the app’s single-page structure."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Ensure hero split layout stacks cleanly on mobile and avoids overflow; keep smooth scrolling behavior for CTA navigation."
        },
        {
          "path": "frontend/src/components/sections/ProjectsSection.tsx",
          "operation": "modify",
          "description": "Ensure project cards and thumbnails remain responsive and optimized for fast loading (appropriate sizing, no layout shift)."
        },
        {
          "path": "frontend/src/components/sections/SkillsSection.tsx",
          "operation": "modify",
          "description": "Ensure the skills icon-card grid is responsive across mobile/tablet/desktop and maintains readable spacing."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Ensure contact form layout remains responsive and accessible across breakpoints with no overflow."
        },
        {
          "path": "frontend/src/components/CursorSpotlight.tsx",
          "operation": "modify",
          "description": "Ensure cursor micro-interactions are lightweight, disabled on touch/coarse pointers, and minimized under prefers-reduced-motion to protect performance."
        },
        {
          "path": "frontend/src/hooks/useScrollReveal.ts",
          "operation": "modify",
          "description": "Ensure scroll-reveal runs once per element (or similarly conservative behavior) and cleans up observers to keep performance smooth."
        },
        {
          "path": "frontend/src/hooks/useParallax.ts",
          "operation": "modify",
          "description": "Ensure parallax uses requestAnimationFrame throttling and transform-only updates, disabled/reduced under prefers-reduced-motion."
        }
      ]
    }
  ]
}